## Pandas Primer part 2
----------------

In [1]:
import pandas as pd
import numpy as np
import datetime as dt
import seaborn as sns; sns.set()
import math
import zmq
import statsmodels.api as sm
import matplotlib.pyplot as plt
import quandl as ql
ql.ApiConfig.api_key= "9Djob1GoNyL-pEK4-vEk"
import pyodbc

In [2]:
cnxn = pyodbc.connect(driver='{SQL Server Native Client 11.0}',
                      server='LAPTOP-2DK08FTD\SQLEXPRESS', 
                      database='AdventureWorksDW2017',               
                      trusted_connection='yes')

### How to go from a Numpy range to a DataFrame

In [3]:
frame7 = pd.DataFrame(np.arange(16).reshape((4,4)), index = [1,2,3,4], 
                   columns = ['Southeast', 'Northeast', 'Central','Northwest'])
frame7

   Southeast  Northeast  Central  Northwest
1          0          1        2          3
2          4          5        6          7
3          8          9       10         11
4         12         13       14         15

<a id="cell20"></a>

In [4]:
# Vectorized operations
frame7['North']= frame7['Northeast'] + frame7['Northwest'] 
frame7

   Southeast  Northeast  Central  Northwest  North
1          0          1        2          3      4
2          4          5        6          7     12
3          8          9       10         11     20
4         12         13       14         15     28

<a id="cell21"></a>

In [5]:
frame7.North

1     4
2    12
3    20
4    28
Name: North, dtype: int32

In [6]:
frame7[frame7.columns[4]]

1     4
2    12
3    20
4    28
Name: North, dtype: int32

### Run operations using uno axis or the other

In [7]:
frame7.sum(axis = 0) # by column

Southeast    24
Northeast    28
Central      32
Northwest    36
North        64
dtype: int64

In [8]:
frame7.sum(axis = 1) # by row

1    10
2    34
3    58
4    82
dtype: int64

<a id="cell23"></a>

In [9]:
frame7

   Southeast  Northeast  Central  Northwest  North
1          0          1        2          3      4
2          4          5        6          7     12
3          8          9       10         11     20
4         12         13       14         15     28

In [10]:
# Changing the values full column
frame7['North'] = 7
frame7

   Southeast  Northeast  Central  Northwest  North
1          0          1        2          3      7
2          4          5        6          7      7
3          8          9       10         11      7
4         12         13       14         15      7

In [11]:
# Changing the values full row
frame7.loc[2] = 9
frame7

   Southeast  Northeast  Central  Northwest  North
1          0          1        2          3      7
2          9          9        9          9      9
3          8          9       10         11      7
4         12         13       14         15      7

In [12]:
# Changing the value of a single cell
frame7.loc[4,'North'] = 66

In [13]:
frame7

   Southeast  Northeast  Central  Northwest  North
1          0          1        2          3      7
2          9          9        9          9      9
3          8          9       10         11      7
4         12         13       14         15     66

In [14]:
obj8 = pd.Series(np.arange(5.), index = ['a','b','c','d','e'])
obj8

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

### Look how by adding . after the number inside the arange() the values are floats
<a id="cell24"></a>

In [15]:
# it drops the value from the series to indicate the element 
# you use the index of the element
new_obj = obj8.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [16]:
new_obj.drop(['a','b'])

d    3.0
e    4.0
dtype: float64

In [17]:
frame8 = frame7.drop(['North'],axis=1)
frame8

   Southeast  Northeast  Central  Northwest
1          0          1        2          3
2          9          9        9          9
3          8          9       10         11
4         12         13       14         15

### Important drop() works to delete values using an 'index' not column reference

<a id="cell25"></a>

In [18]:
del frame7['North']

In [19]:
frame7

   Southeast  Northeast  Central  Northwest
1          0          1        2          3
2          9          9        9          9
3          8          9       10         11
4         12         13       14         15

### Replace method

In [20]:
frame7.replace(9,900)

   Southeast  Northeast  Central  Northwest
1          0          1        2          3
2        900        900      900        900
3          8        900       10         11
4         12         13       14         15

In [21]:
frame7

   Southeast  Northeast  Central  Northwest
1          0          1        2          3
2          9          9        9          9
3          8          9       10         11
4         12         13       14         15

In [22]:
frame7['Northwest'].replace(9,900, inplace = True)
frame7

   Southeast  Northeast  Central  Northwest
1          0          1        2          3
2          9          9        9        900
3          8          9       10         11
4         12         13       14         15

In [23]:
frame7.replace([12,13,14,15],20)

   Southeast  Northeast  Central  Northwest
1          0          1        2          3
2          9          9        9        900
3          8          9       10         11
4         20         20       20         20

In [24]:
frame7.replace([12,13,14,15],[20,21,22,23])

   Southeast  Northeast  Central  Northwest
1          0          1        2          3
2          9          9        9        900
3          8          9       10         11
4         20         21       22         23

In [25]:
frame7.replace({0:1000,1:2000,2:3000,300:4000})

   Southeast  Northeast  Central  Northwest
1       1000       2000     3000          3
2          9          9        9        900
3          8          9       10         11
4         12         13       14         15

In [26]:
frame7.replace({'Southeast':{0:1000,9:2000,8:3000,12:4000}})

   Southeast  Northeast  Central  Northwest
1       1000          1        2          3
2       2000          9        9        900
3       3000          9       10         11
4       4000         13       14         15

## Date Ranges using Pandas
<a id="cell27"></a>

In [27]:
sql = """SELECT FF.FinanceKey,DD.FullDateAlternateKey,DO.OrganizationName,DDep.DepartmentGroupName,DS.ScenarioName, DA.AccountDescription, DA.AccountType,FF.Amount

FROM FactFinance as FF JOIN DimDate as DD ON FF.DateKey = DD.DateKey
JOIN DimOrganization AS DO
ON FF.OrganizationKey = DO.OrganizationKey
JOIN DimDepartmentGroup AS DDep
ON FF.DepartmentGroupKey = DDep.DepartmentGroupKey
JOIN DimScenario AS DS
ON FF.ScenarioKey = DS.ScenarioKey
JOIN DimAccount AS DA
ON FF.AccountKey = DA.AccountKey
"""

In [28]:
datesql =pd.DataFrame()
dataa = pd.read_sql(sql,cnxn)
datesql['FullDateAlternateKey']= pd.to_datetime(dataa['FullDateAlternateKey'])
datesql

      FullDateAlternateKey
0               2010-12-29
1               2010-12-29
2               2010-12-29
3               2010-12-29
4               2010-12-29
...                    ...
39404           2013-12-28
39405           2013-12-28
39406           2013-12-28
39407           2013-12-28
39408           2013-12-28

[39409 rows x 1 columns]

In [29]:
datesql.head(1).values

array([['2010-12-29T00:00:00.000000000']], dtype='datetime64[ns]')

In [30]:
dates = pd.date_range('2017-1-1', periods = 9, freq = 'M')
dates

DatetimeIndex(['2017-01-31', '2017-02-28', '2017-03-31', '2017-04-30',
               '2017-05-31', '2017-06-30', '2017-07-31', '2017-08-31',
               '2017-09-30'],
              dtype='datetime64[ns]', freq='M')

<a id="cell28"></a>

## Date_range function:

<table class="table table-striped table-bordered">
<tr>
<th style="width:20%">Parameter</th><th style="width:30%">Format</th><th style="width:50%">Description</th>
</tr>
<tr>
<td>start</td>
<td>string/datetime</td>
<td>left bound for generating dates</td>
</tr>
<tr>
<td>end</td>
<td>string/datetime</td>
<td>right bound for generating dates</td>
</tr>
<tr>
<td>periods</td>
<td>integer/None</td>
<td>number of periods(if start or end are None)</td>
</tr>
<tr>
<td>freq</td>
<td>string/Dateoffset</td>
<td>frequency string , 5D for five days</td>
</tr>
<tr>
<td>tz</td>
<td>string/None</td>
<td>time zone name for localized index</td>
</tr>
<tr>
<td>normalize</td>
<td>bool, default None</td>
<td>normalize start and end to midnight</td>
</tr>
<tr>
<td>name</td>
<td>string, default None</td>
<td>name of resulting index</td>
</tr>
</table>

<a id="cell29"></a>
## Frequency parameter values:

<table class="table table-striped table-bordered">
<tr>
<th style="width:20%">Alias</th><th style="width:80%">Description</th>
</tr>
<tr>
<td>B</td>
<td>Business day frequency</td>
</tr>
<tr>
<td>C</td>
<td>Custom business day frequency</td>
</tr>
<tr>
<td>D</td>
<td>Calendar day frequency</td>
</tr>
<tr>
<td>W</td>
<td>Weekly frequency</td>
</tr>
<tr>
<td>M</td>
<td>Month end frequency</td>
</tr>
<tr>
<td>BM</td>
<td>Business month end frequency</td>
</tr>
<tr>
<td>MS</td>
<td>Month start frequency</td>
</tr>
<tr>
<td>BMS</td>
<td>Business month start frequency</td>
</tr>
<tr>
<td>Q</td>
<td>Quarter end frequency</td>
</tr>
<tr>
<td>BQ</td>
<td>Business quarter end frequency</td>
</tr>
<tr>
<td>QS</td>
<td>Quarter start frequency</td>
</tr>
<tr>
<td>BQS</td>
<td>Business Quarter start frequency</td>
</tr>
<tr>
<td>A</td>
<td>Year end frequency</td>
</tr>
<tr>
<td>BA</td>
<td>Business year end frequency</td>
</tr>
<tr>
<td>AS</td>
<td>Year start frequency</td>
</tr>
<tr>
<td>BAS</td>
<td>Business year start frequency</td>
</tr>
<tr>
<td>H</td>
<td>Hourly frequency</td>
</tr>
<tr>
<td>M</td>
<td>Minutely frequency</td>
</tr>
<tr>
<td>S</td>
<td>Secondly frequency</td>
</tr>
<tr>
<td>L</td>
<td>Miliseconds frequency</td>
</tr>
<tr>
<td>U</td>
<td>Microseconds frequency</td>
</tr>
</table>